Revit 2027 API
PropertyLine.IsValidPropertyTable Method
 Function used to check the input table is valid to create property line element
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsValidPropertyTable(
	Document document,
	IList<PropertyTableEntry> pt
)
Public Shared Function IsValidPropertyTable (
	document As Document,
	pt As IList(Of PropertyTableEntry)
) As Boolean
public:
static bool IsValidPropertyTable(
	Document^ document,
	IList<PropertyTableEntry^>^ pt
)
static member IsValidPropertyTable :
        document : Document *
        pt : IList<PropertyTableEntry> -> bool
Parameters
document Document
 The document to check.
pt IList<PropertyTableEntry>
 Input property table to valid.
Return Value
Boolean
 True if it is valid to create PropertyLine; otherwise it is not valid to create propertyline.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
PropertyLine Class
Autodesk.Revit.DB Namespace